Incompressible_case1/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.2997135;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.2997135;
    }

    outlet
    {
        type            zeroGradient;
    }
    symmetry
    {
        type            slip;
    }
    wall
    {
        type		kqRWallFunction;
    	value 		uniform 1e-10;
    }
    floor
    {
    	type 		kqRWallFunction;
    	value 		uniform 1e-10;
    }


    body
    {
    	type 		kqRWallFunction;
    	value 		uniform 1e-10;
    }

    defaultFaces
    {
       // type            compressible::kqRWallFunction;
      //  value           uniform 234.375;
        type            fixedValue;
        value           uniform 1e-10;
    }

}


// ************************************************************************* //
