Incompressible_case1/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    defaultFaces
    {
        type            wall;
        inGroups        1(wall);
        nFaces          0;
        startFace       23351891;
    }
    body
    {
        type            wall;
        inGroups        1(wall);
        nFaces          242591;
        startFace       23351891;
    }
    floor
    {
        type            wall;
        inGroups        1(wall);
        nFaces          55462;
        startFace       23594482;
    }
    inlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2311;
        startFace       23649944;
    }
    outlet
    {
        type            wall;
        inGroups        1(wall);
        nFaces          2338;
        startFace       23652255;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          207442;
        startFace       23654593;
    }
)

// ************************************************************************* //
