Incompressible_case1/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

 convertToMeters 1;

vertices
(
	( -9.0 -1.8954242741 -1.721360002 )
	( 21.0 -1.8954242741 -1.721360002 )
	( 21.0 1.89662 -1.721360002 )
	( -9.0 1.89662 -1.721360002 )
	( -9.0 -1.8954242741 1.8965902559 )
	( 21.0 -1.8954242741 1.8965902559 )
	( 21.0 1.89662 1.8965902559 )
	( -9.0 1.89662 1.8965902559 )
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (540 76 72) simpleGrading (1 1 1)
);

edges
(
);

boundary
(

);

// ************************************************************************* //
